APITest_GetFlight/Report/Data/Step2.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity4</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_InputXml_53b69f6d-eb99-4ea9-92e8-12bdb3b7d7b9.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;Body&gt;
    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
      &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
      &lt;FlightDate&gt;2018-11-30T00:00:00+07:00&lt;/FlightDate&gt;
    &lt;/GetFlights&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">HPFlights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">GetFlights</Operation><Address name="Address">http://localhost:8000/HPFlights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity4_Full_request_837f6c0b-9eb0-499a-a8d9-e9eb252d7ae8.xml">&lt;Envelope xmlns="htt ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	254
Expect:	100-continue
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	1893
Content-Type:	text/xml; charset=utf-8
Date:	Mon, 12 Nov 2018 06:41:29 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;NW&lt;/Airline&gt;&lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;07:55 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;06:15 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;15113&lt;/FlightNumber&gt;&lt;Price&gt;138.6&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;NW&lt;/Airline&gt;&lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:07 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;01:27 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;15567&lt;/FlightNumber&gt;&lt;Price&gt;155&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AF&lt;/Airline&gt;&lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:00 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;15827&lt;/FlightNumber&gt;&lt;Price&gt;165.5&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AF&lt;/Airline&gt;&lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;12:24 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;15831&lt;/FlightNumber&gt;&lt;Price&gt;162.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AF&lt;/Airline&gt;&lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;02:48 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;15835&lt;/FlightNumber&gt;&lt;Price&gt;165.6&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AF&lt;/Airline&gt;&lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;05:12 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;15839&lt;/FlightNumber&gt;&lt;Price&gt;165.7&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;NW&lt;/Airline&gt;&lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:31 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;&lt;DepartureTime&gt;09:51 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;16228&lt;/FlightNumber&gt;&lt;Price&gt;168.2&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_OutputXml_52dfa10b-1663-4486-89e4-c952436c5495.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;NW&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;07:55 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;06:15 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;15113&lt;/FlightNumber&gt;
          &lt;Price&gt;138.6&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;NW&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;03:07 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;01:27 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;15567&lt;/FlightNumber&gt;
          &lt;Price&gt;155&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AF&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;10:00 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;15827&lt;/FlightNumber&gt;
          &lt;Price&gt;165.5&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AF&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;12:24 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;15831&lt;/FlightNumber&gt;
          &lt;Price&gt;162.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AF&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;02:48 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;15835&lt;/FlightNumber&gt;
          &lt;Price&gt;165.6&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AF&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;05:12 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;15839&lt;/FlightNumber&gt;
          &lt;Price&gt;165.7&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;NW&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Paris&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;11:31 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;Denver&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;09:51 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;16228&lt;/FlightNumber&gt;
          &lt;Price&gt;168.2&lt;/Price&gt;
        &lt;/Flight&gt;
      &lt;/GetFlightsResult&gt;
    &lt;/GetFlightsResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'GetFlights'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>